tutorials/nLightAFX/constant/nLightAFX.cfg
/*---------------------------------------------------------------------------*\
  nLight AFX-1000 heat source mode include file

  Values are from the ORNL-characterized AFX beam profiles.

  Units in this file are SI:
      dimensions  [m]
      radius      [m]
      sigma       [m]

  Usage pattern:

      #include "heatSourceDict.cfg"

      <sourceName>
      {
          ...

          heatSourceModel nLightAFX;

          nLightAFXCoeffs
          {
              $Index0

              transient   true;
              isoValue    1700;
              nPoints     (10 10 10);
          }
      }
\*---------------------------------------------------------------------------*/

// Initial heat-source depth for inner and outer components.
depth 5.0e-5;

// Axial projected-Gaussian closure coefficients: n = A*log2(x) + B
innerA 0.0;
innerB 1.0;
outerA 0.0;
outerB 1.0;

//  0: D4 = 109.69 um
Index0
{
    dimensions  (5.4845e-5 5.4845e-5 $depth);

    alpha       0.033;

    inner
    {
        radius  1.2840e-5;
        sigma   2.0650e-5;
        A       $innerA;
        B       $innerB;
    }

    outer
    {
        radius  1.0593e-4;
        sigma   1.6620e-5;
        A       $outerA;
        B       $outerB;
    }
}

//  1: D4 = 162.42 um
Index1
{
    dimensions  (8.1210e-5 8.1210e-5 $depth);

    alpha       0.210;

    inner
    {
        radius  1.4140e-5;
        sigma   2.0335e-5;
        A       $innerA;
        B       $innerB;
    }

    outer
    {
        radius  1.0154e-4;
        sigma   1.7935e-5;
        A       $outerA;
        B       $outerB;
    }
}

//  2: D4 = 188.70 um
Index2
{
    dimensions  (9.4350e-5 9.4350e-5 $depth);

    alpha       0.326;

    inner
    {
        radius  1.4390e-5;
        sigma   2.0625e-5;
        A       $innerA;
        B       $innerB;
    }

    outer
    {
        radius  1.0113e-4;
        sigma   1.75825e-5;
        A       $outerA;
        B       $outerB;
    }
}

//  3: D4 = 218.58 um
Index3
{
    dimensions  (1.0929e-4 1.0929e-4 $depth);

    alpha       0.483;

    inner
    {
        radius  1.4390e-5;
        sigma   2.0780e-5;
        A       $innerA;
        B       $innerB;
    }

    outer
    {
        radius  1.0098e-4;
        sigma   1.69225e-5;
        A       $outerA;
        B       $outerB;
    }
}

//  4: D4 = 251.45 um
Index4
{
    dimensions  (1.25725e-4 1.25725e-4 $depth);

    alpha       0.678;

    inner
    {
        radius  1.4900e-5;
        sigma   2.1595e-5;
        A       $innerA;
        B       $innerB;
    }

    outer
    {
        radius  1.0103e-4;
        sigma   1.65425e-5;
        A       $outerA;
        B       $outerB;
    }
}

//  5: D4 = 270.98 um
Index5
{
    dimensions  (1.3549e-4 1.3549e-4 $depth);

    alpha       0.805;

    inner
    {
        radius  1.8060e-5;
        sigma   2.2350e-5;
        A       $innerA;
        B       $innerB;
    }

    outer
    {
        radius  1.0109e-4;
        sigma   1.6450e-5;
        A       $outerA;
        B       $outerB;
    }
}

//  6: D4 = 285.81 um
Index6
{
    dimensions  (1.42905e-4 1.42905e-4 $depth);

    alpha       0.902;

    inner
    {
        radius  3.3500e-5;
        sigma   1.8510e-5;
        A       $innerA;
        B       $innerB;
    }

    outer
    {
        radius  1.0141e-4;
        sigma   1.63475e-5;
        A       $outerA;
        B       $outerB;
    }
}

// ************************************************************************* //
