tutorials/nLightAFX/constant/scanPath
Mode    X       Y       Z   Power   Param
1       0.000   0.000   0   0       0
0       0.002   0.000   0   400     0.8
